{
    "class_name": "Model",
    "config": {
        "name": "model_2",
        "layers": [
            {
                "name": "input_3",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_3"
                },
                "inbound_nodes": []
            },
            {
                "name": "initial_conv2D",
                "class_name": "Conv2D",
                "config": {
                    "name": "initial_conv2D",
                    "trainable": true,
                    "filters": 16,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_79",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_79",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "initial_conv2D",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_81",
                "class_name": "Activation",
                "config": {
                    "name": "activation_81",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_79",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_77",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_77",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_81",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_73",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_73",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "initial_conv2D",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_77",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_80",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_80",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_73",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_82",
                "class_name": "Activation",
                "config": {
                    "name": "activation_82",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_80",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_78",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_78",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_82",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_74",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_74",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_73",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_78",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_81",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_81",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_74",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_83",
                "class_name": "Activation",
                "config": {
                    "name": "activation_83",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_81",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_79",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_79",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_83",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_75",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_75",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_74",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_79",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_82",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_82",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_75",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_84",
                "class_name": "Activation",
                "config": {
                    "name": "activation_84",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_82",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_80",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_80",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_84",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_76",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_76",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_75",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_80",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_83",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_83",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_76",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_85",
                "class_name": "Activation",
                "config": {
                    "name": "activation_85",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_83",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_81",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_81",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_85",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_77",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_77",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_76",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_81",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_84",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_84",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_77",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_86",
                "class_name": "Activation",
                "config": {
                    "name": "activation_86",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_84",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_82",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_82",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_86",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_78",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_78",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_77",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_82",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_85",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_85",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_78",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_87",
                "class_name": "Activation",
                "config": {
                    "name": "activation_87",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_85",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_83",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_83",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_87",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_79",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_79",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_78",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_83",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_86",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_86",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_79",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_88",
                "class_name": "Activation",
                "config": {
                    "name": "activation_88",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_86",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_84",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_84",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_88",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_80",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_80",
                    "trainable": true,
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_79",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_84",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_87",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_87",
                    "trainable": true,
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "gamma_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_80",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_89",
                "class_name": "Activation",
                "config": {
                    "name": "activation_89",
                    "trainable": true,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_87",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_85",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_85",
                    "trainable": true,
                    "filters": 12,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 9.999999747378752e-05
                        }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_89",
                            0,
                            0,
                            {}
